{
  "Invalid_uspapi": "Any USP API string that is not 4 characters long or has invalid values (e.g., 2YYY or any character that is not Y, N, or -) will appear in the PotentiallyNonCompliantSites sheet with this reason.",
  "Invalid_usp_cookies": "Any USP Cookies string that is not 4 characters long or has invalid values (e.g., 2YYY or any character that is not Y, N, or -) will appear in the PotentiallyNonCompliantSites sheet with this reason.",
  "uspapi": "See USPS tab. If the uspapi is listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "usp_cookies": "See USPS tab. If the usp_cookies is listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "MissingAfter_uspapi": "See USPS tab. If the uspapi is listed as 'Did Not Opt Out ✺', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "MissingAfter_usp_cookies": "See USPS tab. If the usp_cookies is listed as 'Did Not Opt Out ✺', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "Invalid_GPPString": "If there is an encoded GPP string that cannot be decoded using the decoder, this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "SaleOptOut_USNAT": "See GPP tab. If the usnatv1 GPP string has SaleOptOut values from decoded_gpp_before_gpc and decoded_gpp_after_gpc listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet. Both the before and after must come from the usnatv1 GPP string.",
  "SharingOptOut_USNAT": "See GPP tab. If the usnatv1 GPP string has SharingOptOut values from decoded_gpp_before_gpc and decoded_gpp_after_gpc listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet. Both the before and after must come from the usnatv1 GPP string.",
  "TargetedAdvertisingOptOut_USNAT": "See GPP tab. If the usnatv1 GPP string has TargetedAdvertisingOptOut values from decoded_gpp_before_gpc and decoded_gpp_after_gpc listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet. Both the before and after must come from the usnatv1 GPP string. However, if the usnatv1 string is being analyzed from a website accessed in California, anything usually considered 'Did Not Opt Out' or 'Did Not Opt Out ✺' will be considered 'Not Applicable' and this reason will NOT appear.",
  "SaleOptOut_State": "See GPP tab. If the relevant state GPP string (uscav1 for California, uscov1 for Colorado, or usctv1 for Connecticut) has SaleOptOut values listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet. Both the before and after must come from the same state GPP string; one cannot switch between usnatv1 and a state GPP string.",
  "SharingOptOut_State": "See GPP tab. If the relevant state GPP string (uscav1 for California, uscov1 for Colorado, or usctv1 for Connecticut) has SharingOptOut values listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet. Both the before and after must come from the same state GPP string; one cannot switch between usnatv1 and a state GPP string.",
  "TargetedAdvertisingOptOut_State": "See GPP tab. If the relevant state GPP string (uscov1 for Colorado or usctv1 for Connecticut; note that uscav1 in California does not have TargetedAdvertisingOptOut) has TargetedAdvertisingOptOut values listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet. Both the before and after must come from the same state GPP string; one cannot switch between usnatv1 and a state GPP string.",
  "MissingAfterGPPString": "See GPP tab. If the GPP string is listed as 'Did Not Opt Out ✺', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "Invalid_OptanonConsent": "If isGpcEnabled is not in OptanonConsent_after_gpc, or if it equals a value other than 1 or 0, this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "OptanonConsent": "See OptanonConsent tab. If the OptanonConsent values are listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "MissingAfterOptanonConsent": "See OptanonConsent tab. If the OptanonConsent values are listed as 'Did Not Opt Out ✺', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "Well-Known": "See Well-Known tab. If the .well-known/gpc.json values are listed as 'Did Not Opt Out', this reason will appear in the PotentiallyNonCompliantSites sheet.",
  "Invalid_Well-Known": "Any .well-known/gpc.json that is not None or null and does not contain a 'gpc' section will appear in the PotentiallyNonCompliantSites sheet with this reason.",
  "SegmentSwitchGPP": "If in decoded_gpp_before_gpc there is only a usnatv1 string and in decoded_gpp_after_gpc there is only a state string, or vice versa, this reason will appear in the PotentiallyNonCompliantSites sheet."
}
