{
    "Site URL": "The full URL of the website that was analyzed by the crawler.",
    "site_id": "A unique numerical identifier assigned to the site within the dataset.",
    "status": "The current processing status of the site (e.g., 'added', 'not added').",
    "domain": "The root domain name of the site (e.g., 'example.com').",
    "sent_gpc": "Indicates whether the Global Privacy Control (GPC) signal was effectively sent to the site during the crawl.",
    "gpp_version": "The version of the IAB Global Privacy Platform (GPP) detected on the site.",
    "uspapi_before_gpc": "The value returned by the U.S. Privacy API (__uspapi) BEFORE the GPC signal was sent. This API allows vendors to query a user's privacy preferences.",
    "uspapi_after_gpc": "The value returned by the U.S. Privacy API (__uspapi) AFTER the GPC signal was sent. We check if the 3rd character changes to 'Y' such as '1NNN' -> '1NYN' (Yes, opted out). If it is 'N' (No, not opted out) and other fields also don't recognize the GPC signal, we consider it a potential non-compliance.",
    "usp_cookies_before_gpc": "The content of the 'usprivacy' cookie BEFORE the GPC signal was sent. This cookie stores the U.S. Privacy String.",
    "usp_cookies_after_gpc": "The content of the 'usprivacy' cookie AFTER the GPC signal was sent.  We check if the 3rd character changes to 'Y' such as '1NNN' -> '1NYN' (Yes, opted out). If it is 'N' (No, not opted out) and other fields also don't recognize the GPC signal, we consider it a potential non-compliance.",
    "OptanonConsent_before_gpc": "The value of the OneTrust 'OptanonConsent' cookie BEFORE the GPC signal. This cookie manages user consent preferences.",
    "OptanonConsent_after_gpc": "The value of the OneTrust 'OptanonConsent' cookie AFTER the GPC signal. We look for 'isGpcEnabled=1' to see if GPC is respected. If 'isGpcEnabled=0' and other fields also don't recognize the GPC signal, we consider it a potential non-compliance.",
    "gpp_before_gpc": "The raw IAB Global Privacy Platform (GPP) string detected BEFORE the GPC signal was sent.",
    "gpp_after_gpc": "The raw IAB Global Privacy Platform (GPP) string detected AFTER the GPC signal was sent.",
    "urlClassification": "Categorization of the URLs on the page by Firefox (e.g. 'tracking_ads' vs 'tracking_social').",
    "OneTrustWPCCPAGoogleOptOut_before_gpc": "Status of the OneTrust CCPA Google Opt-Out mechanism BEFORE GPC signal.",
    "OneTrustWPCCPAGoogleOptOut_after_gpc": "Status of the OneTrust CCPA Google Opt-Out mechanism AFTER GPC signal.",
    "OTGPPConsent_before_gpc": "OneTrust-specific GPP consent status BEFORE GPC signal.",
    "OTGPPConsent_after_gpc": "OneTrust-specific GPP consent status AFTER GPC signal.",
    "usps_before_gpc": "The U.S. Privacy String (USPS) detected BEFORE GPC. Character 3 ('Y'/'N') indicates if the user has opted out of sale. For example, '1YYN' indicates the user was opted out of sale, while '1YNN' indicates they were not.",
    "usps_after_gpc": "The U.S. Privacy String (USPS) detected AFTER GPC. We check if the 3rd character changes to 'Y' such as '1NNN' -> '1NYN' (Yes, opted out). If it is 'N' (No, not opted out) and other fields also don't recognize the GPC signal, we consider it a potential non-compliance.",
    "decoded_gpp_before_gpc": "The human-readable contents of the GPP string (decoded) BEFORE GPC. Shows which sections (e.g., uscav1) are present.",
    "decoded_gpp_after_gpc": "The human-readable contents of the GPP string (decoded) AFTER GPC. We check for 'SaleOptOut' or 'SharingOptOut' flags here.",
    "USPS implementation": "Details on how the site implements the US Privacy String (e.g., via API, Cookie, or both).",
    "error": "Any error message logged during the crawl (e.g., timeouts, connection refusals).",
    "Well-known": "Status of the /.well-known/gpc.json resource, which allows sites to publicly declare GPC support.",
    "Tranco": "The site's traffic rank from the Tranco list. Lower numbers mean higher traffic.",
    "third_party_count": "The total number of unique third-party domains detected on the site.",
    "third_party_urls": "A list of the specific third-party URLs that were detected.",
    "unique_ad_networks": "Names of unique advertising networks identified on the site.",
    "num_unique_ad_networks": "The count of unique advertising networks identified."
}